In [7]:
import sqlite3 as sl
import pandas as pd

con = sl.connect('test.db')

print ("Opened database successfully")

Opened database successfully

<mark>DROP TABLES</mark>

In [8]:
#con.execute ('DROP TABLE charms_class')
#con.execute ('DROP TABLE charms_class1')

In [9]:
with con:
    con.execute (""" CREATE TABLE charms_class1 (
    student_name varchar(255),
    charms_grade varchar(255)
 );""")

print ("Charms class Table created successfully")

Charms class Table created successfully

<mark>INSERT VALUES INTO TABLE 1</mark>

In [10]:
sql = 'INSERT INTO charms_class1 (student_name, charms_grade) values(?,?)'
data = [('Harry', 'C'),
   ('Ron', 'D'),
  ('Hermione', 'A'),
  ('Luna', 'B'),
 ('Neville', 'B')]


with con:
    con.executemany(sql, data)

<mark>VIEW OUTPUT</mark>

In [11]:
with con:
   data=con.execute('SELECT * FROM charms_class1') 
   for row in data:
       print (row)

('Harry', 'C')
('Ron', 'D')
('Hermione', 'A')
('Luna', 'B')
('Neville', 'B')

In [12]:
charms=pd.read_sql_query('SELECT * FROM charms_class1', con)
charms

  student_name charms_grade
0        Harry            C
1          Ron            D
2     Hermione            A
3         Luna            B
4      Neville            B

In [13]:
cursor=con.execute('SELECT student_name, charms_grade FROM charms_class1')
for row in cursor:
    print ('student_name= ', row[0])
    print ('charms_grade= ', row[1])

student_name=  Harry
charms_grade=  C
student_name=  Ron
charms_grade=  D
student_name=  Hermione
charms_grade=  A
student_name=  Luna
charms_grade=  B
student_name=  Neville
charms_grade=  B

<mark>UPDATE A ROW</mark>

In [14]:
con.execute("UPDATE charms_class1 set charms_grade = 'C+' where student_name = 'Ron'")
con.commit
print ("Total number of rows updated :"), con.total_changes

Total number of rows updated :

(None, 6)

In [15]:
cursor=con.execute('SELECT student_name, charms_grade FROM charms_class1')
for row in cursor:
    print ('student_name= ', row[0])
    print ('charms_grade= ', row[1])

student_name=  Harry
charms_grade=  C
student_name=  Ron
charms_grade=  C+
student_name=  Hermione
charms_grade=  A
student_name=  Luna
charms_grade=  B
student_name=  Neville
charms_grade=  B

<mark>DELETE A RECORD</mark>

In [16]:
con.execute("DELETE FROM charms_class1 where student_name = 'Luna';")
con.commit()
print ("Total number of rows deleted :"), con.total_changes

Total number of rows deleted :

(None, 7)

In [17]:
cursor=con.execute('SELECT student_name, charms_grade FROM charms_class1')
for row in cursor:
    print ('student_name= ', row[0])
    print ('charms_grade= ', row[1])

student_name=  Harry
charms_grade=  C
student_name=  Ron
charms_grade=  C+
student_name=  Hermione
charms_grade=  A
student_name=  Neville
charms_grade=  B

<mark>DROP POTIONS TABLE IF NEEDED</mark>

In [25]:
#con.execute ('DROP TABLE potions_class')

<mark>CREATE TABLE 2</mark>

In [19]:
with con:#
    con.execute (""" CREATE TABLE potions_class (
    student_name varchar(255),
    potions_grade varchar(255)
 );""")

print ("Potions class Table created successfully")

Potions class Table created successfully

<mark>TABLE 2 VALUES</mark>

In [20]:
sql = 'INSERT INTO potions_class (student_name, potions_grade) values(?,?)'
data = [('Harry', 'F'),
    ('Ron', 'C'),
   ('Hermione', 'A+'),
  ('Draco', 'E')]

with con:
    con.executemany(sql, data)

In [21]:
potions=pd.read_sql_query('SELECT * FROM potions_class', con)
potions

  student_name potions_grade
0        Harry             F
1          Ron             C
2     Hermione            A+
3        Draco             E

<mark>JOIN</mark>

In [22]:
df = pd.read_sql('''
    SELECT p.student_name, p.potions_grade, c.charms_grade
    FROM potions_class p LEFT JOIN charms_class1 c ON p.student_name = c.student_name
''', con)

df

  student_name potions_grade charms_grade
0        Harry             F            C
1          Ron             C           C+
2     Hermione            A+            A
3        Draco             E         None

<mark>SLICING</mark>

In [24]:
df1=df[2:4]
df1

  student_name potions_grade charms_grade
2     Hermione            A+            A
3        Draco             E         None

<mark>SELECT SPECIFIC COLUMN</mark>

In [26]:
df2=df.loc[:,['student_name']].head()
df2

  student_name
0        Harry
1          Ron
2     Hermione
3        Draco

<mark>SORT VALUES</mark>

In [27]:
df.sort_values(by='potions_grade').head()

  student_name potions_grade charms_grade
2     Hermione            A+            A
1          Ron             C           C+
3        Draco             E         None
0        Harry             F            C